/**
 * js엔진, 구글 : v8 에서 c++ 을 더한 것 : node.js
 * 모듈에는 사용자가 만든 모듈, 시스템모듈, 빌드인모듈
 */

// const add = (a,b) => {
//     return a+b
// }

// export해서 다른 파일이 불러올 수 있게 만듬
// 모듈단위, 불러올 때 require() 사용 /

// console.log(__dirname);
// console.log(__filename);

/////////////////////////////-1.add ///////////////////////////////////////////////////////////


// const add = require('./1.add');
// console.log(add(1,2));
// console.log('Form index.js');


///////////////////////////////2. batman / superman //////////////////////////////////////////

require('./2.batman');
require('./2.superman');

/* 모듈은 가각의 범위(scope)를 가지고 있다. 따라서 같은 변수 사용 가능 */


//////////////////////////////////////////////////////////////////////////////////////////////////

//모듈의 기초형태

//()() = 함수의 자동실행 형태 
(function () {
    const superHero = 'Superman';
    console.log('superman');
})()

// 모듈의 형태
// (function (exports, require, module, __filename, __dirname) {
//     코드 
// })()

//////////////////////////////////////////////////////////////////////////////////////////////////

